Infineon/mtb-example-psoc6-emwin-eink-freertos/source/eink_task.c
/******************************************************************************
* 
* File Name: eink_task.c
*
* Description: This file contains task and functions related to the of E-Ink
* that demonstrates controlling a EInk display using the EmWin Graphics Library.
* The project displays a start up screen with Cypress logo and
* text "CYPRESS EMWIN GRAPHICS DEMO EINK DISPLAY".
*
* The project then displays the following screens in a loop
*
*   1. A screen showing various text alignments, styles and modes
*   2. A screen showing normal fonts
*   3. A screen showing bold fonts
*   4. A screen showing 2D graphics with horizontal lines, vertical lines
*       arcs and filled rounded rectangle
*   5. A screen showing 2D graphics with concentric circles and ellipses
*   6. A screen showing a text box with wrapped text
*
*******************************************************************************
* (c) 2019-2020, Cypress Semiconductor Corporation. All rights reserved.
*******************************************************************************
* This software, including source code, documentation and related materials
* ("Software"), is owned by Cypress Semiconductor Corporation or one of its
* subsidiaries ("Cypress") and is protected by and subject to worldwide patent
* protection (United States and foreign), United States copyright laws and
* international treaty provisions. Therefore, you may use this Software only
* as provided in the license agreement accompanying the software package from
* which you obtained this Software ("EULA").
*
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software source
* code solely for use in connection with Cypress's integrated circuit products.
* Any reproduction, modification, translation, compilation, or representation
* of this Software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer of such
* system or application assumes all risk of such use and in doing so agrees to
* indemnify Cypress against all liability.
*******************************************************************************/
#include "cyhal.h"
#include "cybsp.h"
#include "GUI.h"
#include "pervasive_eink_hardware_driver.h"
#include "cy_eink_library.h"
#include "LCDConf.h"
#include "FreeRTOS.h"
#include "task.h"
#include "images.h"

/*******************************************************************************
* Macros
*******************************************************************************/
#define DELAY_AFTER_STARTUP_SCREEN_MS       (2000)
#define AMBIENT_TEMPERATURE_CELCIUS         (20)

/*******************************************************************************
* Forward declaration
*******************************************************************************/
void show_font_sizes_normal(void);
void show_font_sizes_bold(void);
void show_text_modes(void);
void show_text_wrap_and_orientation(void);
void show_2d_graphics_1(void);
void show_2d_graphics_2(void);
void update_display(cy_eink_update_t update_method, bool power_cycle);
void show_startup_screen(void);
void show_instructions_screen(void);
void wait_for_switch_press_and_release(void);
void clear_screen(void);

/*******************************************************************************
* Function Name: void update_display(void)
********************************************************************************
*
* Summary: This function updates the display with the data in the display
*          buffer.  The function first transfers the content of the EmWin
*          display buffer to the primary EInk display buffer.  Then it calls
*          the Cy_EINK_ShowFrame function to update the display, and then
*          it copies the EmWin display buffer to the Eink display cache buffer
*
* Parameters:
*  None
*
* Return:
*  None
*
* Side Effects:
*  It takes about a second to refresh the display.  This is a blocking function
*  and only returns after the display refresh
*
*******************************************************************************/
void update_display(cy_eink_update_t update_method, bool power_cycle)
{
    cy_eink_frame_t* pEmwin_buffer;

    /* Display frame buffer cache */
    uint8 image_buffer_cache[PV_EINK_IMAGE_SIZE] = {0};

    /* Get the pointer to Emwin's display buffer */
    pEmwin_buffer = (cy_eink_frame_t*)LCD_GetDisplayBuffer();

    /* Update the EInk display */
    Cy_EINK_ShowFrame(image_buffer_cache, pEmwin_buffer, update_method, power_cycle);

    /* Copy the EmWin display buffer to the imageBuffer cache*/
    memcpy(image_buffer_cache, pEmwin_buffer, CY_EINK_FRAME_SIZE);
}

/*******************************************************************************
* Function Name: void show_startup_screen(void)
********************************************************************************
*
* Summary: This function displays the startup screen with Cypress Logo and
*           the demo description text
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void show_startup_screen(void)
{
    /* Set foreground and background color and font size */
    GUI_SetFont(GUI_FONT_16B_1);
    GUI_SetColor(GUI_BLACK);
    GUI_SetBkColor(GUI_WHITE);
    GUI_Clear();

