Infineon/mtb-example-psoc6-emwin-eink-freertos/source/eink_task.c
    /* Send the display buffer data to display*/
    update_display(CY_EINK_FULL_4STAGE, true);
}


/*******************************************************************************
* Function Name: void show_2d_graphics_2(void)
********************************************************************************
*
* Summary: This function displays the following 2D graphics
*           1. Concentric circles
*           2. Concentric ellipses
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void show_2d_graphics_2(void)
{
    /* Set font size, foreground and background colors */
    GUI_SetColor(GUI_BLACK);
    GUI_SetBkColor(GUI_WHITE);
    GUI_SetTextMode(GUI_TM_NORMAL);
    GUI_SetTextStyle(GUI_TS_NORMAL);

    /* Clear the screen */
    GUI_Clear();

    /* Display page title */
    GUI_SetFont(GUI_FONT_13B_1);
    GUI_SetTextAlign(GUI_TA_HCENTER);
    GUI_DispStringAt("6 OF 6: 2D GRAPHICS - 2", 132, 5);

    /* Display labels */
    GUI_SetFont(GUI_FONT_13B_1);
    GUI_SetTextAlign(GUI_TA_HCENTER);
    GUI_DispStringAt("CIRCLE", 68, 85);
    GUI_SetTextAlign(GUI_TA_HCENTER);
    GUI_DispStringAt("ELLIPSE", 204, 85);

    /* Concentric Circles */
    GUI_DrawCircle(68, 51, 30);
    GUI_DrawCircle(68, 51, 25);
    GUI_DrawCircle(68, 51, 20);
    GUI_DrawCircle(68, 51, 15);
    GUI_DrawCircle(68, 51, 10);

    /* Concentric Ellipses */
    GUI_DrawEllipse(204, 51, 50, 30);
    GUI_DrawEllipse(204, 51, 40, 25);
    GUI_DrawEllipse(204, 51, 30, 20);
    GUI_DrawEllipse(204, 51, 20, 15);

    /* Send the display buffer data to display*/
    update_display(CY_EINK_FULL_4STAGE, true);
}


/*******************************************************************************
* Function Name: void clear_screen(void)
********************************************************************************
*
* Summary: This function clears the screen
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void clear_screen(void)
{
    GUI_SetColor(GUI_BLACK);
    GUI_SetBkColor(GUI_WHITE);
    GUI_Clear();
    update_display(CY_EINK_FULL_4STAGE, true);
}


/*******************************************************************************
* Function Name: void wait_for_switch_press_and_release(void)
********************************************************************************
*
* Summary: This implements a simple "Wait for button press and release"
*           function.  It first waits for the button to be pressed and then
*           waits for the button to be released.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Side Effects:
*  This is a blocking function and exits only on a button press and release
*
*******************************************************************************/
void wait_for_switch_press_and_release(void)
{
    /* Wait for SW2 to be pressed */
    while( CYBSP_BTN_PRESSED != cyhal_gpio_read(CYBSP_USER_BTN));

    /* Wait for SW2 to be released */
    while( CYBSP_BTN_PRESSED == cyhal_gpio_read(CYBSP_USER_BTN));
}

/*******************************************************************************
* Function Name: void eInk_task(void *arg)
********************************************************************************
*
* Summary: Following functions are performed
*           1. Initialize the EmWin library
*           2. Display the startup screen for 2 seconds
*           3. Display the instruction screen and wait for key press and release
*           4. Inside a while loop scroll through the 6 demo pages on every
*               key press and release
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void eInk_task(void *arg)
{
    uint8_t page_number = 0;

    /* Array of demo pages functions */
    void (*demoPageArray[])(void) = {
        show_font_sizes_normal,
        show_font_sizes_bold,
        show_text_modes,
        show_text_wrap_and_orientation,
        show_2d_graphics_1,
        show_2d_graphics_2
    };

    uint8_t num_of_demo_pages = (sizeof(demoPageArray)/sizeof(demoPageArray[0]));

    /* Configure Switch and LEDs*/
    cyhal_gpio_init( CYBSP_USER_BTN, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLUP, 
                     CYBSP_BTN_OFF);
    cyhal_gpio_init( CYBSP_USER_LED, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG,
                     CYBSP_LED_STATE_OFF);
    
    /* Initialize EmWin driver*/
    GUI_Init();
    
    /* Start the eInk display interface and turn on the display power */
    Cy_EINK_Start(AMBIENT_TEMPERATURE_CELCIUS);
    Cy_EINK_Power(true);

    /* Show the startup screen */
    show_startup_screen();
    vTaskDelay(DELAY_AFTER_STARTUP_SCREEN_MS);

    /* Show the instructions screen */
    show_instructions_screen();
    wait_for_switch_press_and_release();

    for(;;)
    {
        cyhal_gpio_write( CYBSP_USER_LED, CYBSP_LED_STATE_ON);

        /* Using page_number as index, update the display with a demo screen
            Following are the functions that are called in sequence
                show_font_sizes_normal()
                show_font_sizes_bold()
                show_text_modes()
                show_text_wrap_and_orientation()
                show_2d_graphics_1()
                show_2d_graphics_2()
        */
        (*demoPageArray[page_number])();

        cyhal_gpio_write( CYBSP_USER_LED, CYBSP_LED_STATE_OFF);

        /* Wait for a switch press event */
        wait_for_switch_press_and_release();

        /* Cycle through demo pages */
        page_number = (page_number+1) % num_of_demo_pages;
    }
}
